In [2]:
import pandas as pd
Employee = {'number':[1,2,3,4,5], 'name':['Abby','John','Lina','Mark','Bob'], 'Hourly Salary':[15,20,32,27,40]}
import numpy as np

In [3]:
pd.DataFrame(Employee)

   number  name  Hourly Salary
0       1  Abby             15
1       2  John             20
2       3  Lina             32
3       4  Mark             27
4       5   Bob             40

In [6]:
pd.DataFrame(np.arange(0,20).reshape(5,4),['Row1','Row2','Row3','Row4','Row5'],['Col1','Col2','Col3','Col4'])

      Col1  Col2  Col3  Col4
Row1     0     1     2     3
Row2     4     5     6     7
Row3     8     9    10    11
Row4    12    13    14    15
Row5    16    17    18    19